### Ishaan Mehta E18CSE069 EB02 LabWeek2 Part1

In [10]:
import pandas as pd
import numpy as np
import random

In [11]:
data= pd.read_excel(r"C:\Users\shrey\Downloads\Online Retail.xlsx")
data.head(4)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [12]:
sub=pd.read_excel(r"C:\Users\shrey\Downloads\Online Retail.xlsx",usecols=["InvoiceNo","StockCode","Description","UnitPrice"])
sub.head()

  InvoiceNo StockCode                          Description  UnitPrice
0    536365    85123A   WHITE HANGING HEART T-LIGHT HOLDER       2.55
1    536365     71053                  WHITE METAL LANTERN       3.39
2    536365    84406B       CREAM CUPID HEARTS COAT HANGER       2.75
3    536365    84029G  KNITTED UNION FLAG HOT WATER BOTTLE       3.39
4    536365    84029E       RED WOOLLY HOTTIE WHITE HEART.       3.39

In [14]:
np.where(sub.InvoiceNo=='536365')

(array([], dtype=int64),)

In [15]:
new= pd.read_excel(r"C:\Users\shrey\Downloads\Online Retail.xlsx",usecols=["StockCode","UnitPrice"])
new.head()

  StockCode  UnitPrice
0    85123A       2.55
1     71053       3.39
2    84406B       2.75
3    84029G       3.39
4    84029E       3.39

In [16]:
new["UnitPrice"].mean()

4.611113626083471

In [17]:
new["UnitPrice"].min()

-11062.06

In [18]:
new["UnitPrice"].max()

38970.0

In [19]:
new["UnitPrice"].median()

2.08

In [20]:
new["UnitPrice"].count()

541909

In [21]:
new["UnitPrice"].sum()

2498803.974

In [23]:
new["UnitPrice"].std()

96.75985306119716

In [24]:
new["UnitPrice"].var()

9362.469164424467

In [26]:
skip = pd.read_excel(r"C:\Users\shrey\Downloads\Online Retail.xlsx", skiprows=100)
skip.head()

,536378,84991,60 TEATIME FAIRY CAKE CASES,24,2010-12-01 09:37:00,0.55,14688,United Kingdom
0,536378,84519A,TOMATO CHARLIE+LOLA COASTER SET,6,2010-12-01 09:37:00,2.95,14688.0,United Kingdom
1,536378,85183B,CHARLIE & LOLA WASTEPAPER BIN FLORA,48,2010-12-01 09:37:00,1.25,14688.0,United Kingdom
2,536378,85071B,RED CHARLIE+LOLA PERSONAL DOORSIGN,96,2010-12-01 09:37:00,0.38,14688.0,United Kingdom
3,536378,21931,JUMBO STORAGE BAG SUKI,10,2010-12-01 09:37:00,1.95,14688.0,United Kingdom
4,536378,21929,JUMBO BAG PINK VINTAGE PAISLEY,10,2010-12-01 09:37:00,1.95,14688.0,United Kingdom

In [28]:
data.sort_values(by=['InvoiceDate'])

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541896,581587,22555,PLASTERS IN TIN STRONGMAN,12,2011-12-09 12:50:00,1.65,12680.0,France
541895,581587,22556,PLASTERS IN TIN CIRCUS PARADE,12,2011-12-09 12:50:00,1.65,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541900,581587,22730,ALARM CLOCK BAKELIKE IVORY,4,2011-12-09 12:50:00,3.75,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [36]:
data[data.Description.str.startswith('d',na=False)]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
13264,537432,35833G,damages,-43,2010-12-06 16:10:00,0.0,NaN,United Kingdom
51049,540638,72038P,damages,-990,2011-01-10 12:14:00,0.0,NaN,United Kingdom
105719,545236,22797,damages,-15,2011-03-01 10:32:00,0.0,NaN,United Kingdom
114428,546010,22423,damages,-19,2011-03-08 15:55:00,0.0,NaN,United Kingdom
114535,546021,85175,dotcom sold sets,-345,2011-03-08 17:27:00,0.0,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
522159,580378,22792,damages,-73,2011-12-02 17:56:00,0.0,NaN,United Kingdom
524472,580561,22043,dotcom,-9,2011-12-05 10:25:00,0.0,NaN,United Kingdom
524474,580586,21804,dotcom,4,2011-12-05 10:34:00,0.0,NaN,United Kingdom
535324,581201,22217,damages?,-155,2011-12-07 18:30:00,0.0,NaN,United Kingdom
535328,581205,20893,damages,-55,2011-12-07 18:32:00,0.0,NaN,United Kingdom

In [38]:
#dictionary
df1 = pd.DataFrame({'student name': ['Andreas', 'George', 'Steve',
                           'Sarah', 'Joanna'],
                   'date-of-birth':['2001-10-08','2002-03-08','2001-06-10','2001-11-09','2001-12-08'],
                  'marks in maths':[30,20,10,25,21]})
df1

  student name date-of-birth  marks in maths
0      Andreas    2001-10-08              30
1       George    2002-03-08              20
2        Steve    2001-06-10              10
3        Sarah    2001-11-09              25
4       Joanna    2001-12-08              21

In [41]:
#list of lists
df2 = pd.DataFrame([['Andreas','2001-10-08',30],['George','2002-03-08',20],['Steve','2001-06-10',10],['Sarah','2001-11-09',25],
['Joanna','2001-12-08',21]],columns=["student name","date-of-birth","marks in maths"])
df2

  student name date-of-birth  marks in maths
0      Andreas    2001-10-08              30
1       George    2002-03-08              20
2        Steve    2001-06-10              10
3        Sarah    2001-11-09              25
4       Joanna    2001-12-08              21

In [52]:
#list of dicts
df3 = pd.DataFrame([{'student name': 'Andreas','date-of-birth':'2001-10-08','marks in maths':30},
                    { 'student name': 'George', 'date-of-birth':'2002-03-08','marks in maths':20},
                     {'student name':'Steve','date-of-birth':'2001-06-10','marks in maths':10},
                    {'student name':'Sarah','date-of-birth':'2001-11-09','marks in maths':11},
                     {'student name': 'Joanna','date-of-birth':'2001-12-08','marks in maths':21}],
                   index =['ind1', 'ind2','ind3', 'ind4','ind5'],
                   columns=["student name","date-of-birth","marks in maths"])
df3

     student name date-of-birth  marks in maths
ind1      Andreas    2001-10-08              30
ind2       George    2002-03-08              20
ind3        Steve    2001-06-10              10
ind4        Sarah    2001-11-09              11
ind5       Joanna    2001-12-08              21

In [54]:
dfa = pd.DataFrame(columns = ['student name', 'date of birth', 'marks in english']) 
print(dfa) 
  
# append rows to an empty DataFrame 
dfa = dfa.append({'student name': 'Andreas','date-of-birth':'2001-10-08','marks in english':30},  
                ignore_index = True) 
dfa = dfa.append({'student name': 'Andreas','date-of-birth':'2001-10-08','marks in english':30}, 
                ignore_index = True) 
dfa = dfa.append({'student name': 'Andreas','date-of-birth':'2001-10-08','marks in english':30}, 
               ignore_index = True) 
dfa = dfa.append({'student name': 'Andreas','date-of-birth':'2001-10-08','marks in english':30}, 
               ignore_index = True) 
dfa = dfa.append({'student name': 'Andreas','date-of-birth':'2001-10-08','marks in english':30}, 
               ignore_index = True) 
dfa

Empty DataFrame
Columns: [student name, date of birth, marks in english]
Index: []

  student name date of birth marks in english date-of-birth
0      Andreas           NaN               30    2001-10-08
1      Andreas           NaN               30    2001-10-08
2      Andreas           NaN               30    2001-10-08
3      Andreas           NaN               30    2001-10-08
4      Andreas           NaN               30    2001-10-08

In [67]:
ser1 = pd.Series(np.random.randint(0,100,size=100))
ser2 = pd.Series(np.random.randint(0,100,size=100))
print(ser1)
ser2

0     23
1     95
2     13
3     17
4      8
      ..
95    51
96    29
97    34
98    90
99    93
Length: 100, dtype: int32

0     20
1     15
2     60
3     72
4     56
      ..
95    15
96    28
97    27
98    82
99    29
Length: 100, dtype: int32

In [68]:
add= ser1+ser2
add

0      43
1     110
2      73
3      89
4      64
     ...
95     66
96     57
97     61
98    172
99    122
Length: 100, dtype: int32

In [69]:
sub= ser1-ser2
sub

0      3
1     80
2    -47
3    -55
4    -48
      ..
95    36
96     1
97     7
98     8
99    64
Length: 100, dtype: int32

In [63]:
mul= ser1*ser2
mul

0     2478
1     1584
2     3604
3     5940
4     3008
      ...
95     534
96     910
97    4070
98    1452
99    1328
Length: 100, dtype: int32

In [70]:
div= ser1/ser2
div

0     1.150000
1     6.333333
2     0.216667
3     0.236111
4     0.142857
        ...
95    3.400000
96    1.035714
97    1.259259
98    1.097561
99    3.206897
Length: 100, dtype: float64

In [72]:
#pd.concat([ser1, ser2,add,sub,mul,div], axis=1,)
final= pd.DataFrame(columns = [ "number1" ,"number2", "add", "sub", "mult" ,"div" ])
final['number1'] = ser1
final['number2'] = ser2
final['add'] = add
final['sub'] = sub
final['mult'] = mul
final['div'] = div
final.head(10)

   number1  number2  add  sub  mult       div
0       23       20   43    3  2478  1.150000
1       95       15  110   80  1584  6.333333
2       13       60   73  -47  3604  0.216667
3       17       72   89  -55  5940  0.236111
4        8       56   64  -48  3008  0.142857
5       20       17   37    3  1820  1.176471
6       59       65  124   -6  4968  0.907692
7       12       95  107  -83  3354  0.126316
8       61       39  100   22   854  1.564103
9       90       77  167   13   697  1.168831